import Head from 'next/head';
import { Box } from '@mui/system';
import { Container, Typography } from '@mui/material';

const TermsAndUse = () => {

  return (
    <>
      <Head>
        <title>City dream | Правила використання</title>
        <meta name="description" content="GDPR/Privacy and policy"/>
        <link rel="icon" href="/favicon.ico"/>
      </Head>
      <Box component={'main'}>
        <Container>
          <Box mt={'64px'} mb={'110px'}>
            <Box textAlign={'center'} mb={6}>
              <Typography variant={'h1'} component={'h1'} mb={2}>
                Публічна оферта (short 0.2):
              </Typography>
              <Typography variant={'h3'} component={'h2'}>
                основоположні правила роботи Платформи citydream.pp.ua
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography mb={2}>
                Краудсорсингова платформа City Dream – це онлайн-толока з
                утілення в життя громадських проєктів, що системно покращують
                місто Черкаси та міста-партнери завдяки акумулюванню в одному
                місці ідей та зусиль широкого кола її користувачів (далі за
                текстом – «Платформа»).
              </Typography>
              <Typography mb={2}>
                Розміщено Платформу на Інтернет-сайті citydream.pp.ua (надалі –
                «Сайт»); відносини, що виникають між зацікавленими сторонами в
                процесі роботи Платформи, врегульовано чинними Основоположними
                правилами роботи Платформи City Dream (далі – «Правила»).
              </Typography>
              <Typography mb={2}>
                Платформа City Dream є open source проєктом (з відкритим
                вихідним кодом) і діє під наглядом спільнот GeekHub та Leaders
                Fund, а також була профінансована Європейським Союзом у рамках
                Стипендіальної програми для лідерів громадянського суспільства
                країн Східного партнерства. Сайт відображає позицію команди City
                Dream і не обовʼязково відображає позицію Європейського Союзу.
              </Typography>
              <Typography mb={2}>
                Учасник зобовʼязаний уважно ознайомитися з Правилами перед
                використанням Платформи. Використовуючи будь-яку частину
                Платформи, Учасник автоматично надає свою згоду з умовами даних
                Правил. Якщо Учасник не погоджується з умовами Правил (повністю
                або частково), йому не надається статус Учасник і забороняється
                використовувати Платформу, включаючи, але не обмежуючись,
                будь-яку інформацію, розміщену на Платформі. Ознайомлення
                Учасника з цими правилами є підтвердженням погодження Учасника з
                усіма положеннями Правил.
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                1. Терміни та визначення
              </Typography>
              <Typography mb={2}>
                <Typography
                  component={'span'}
                  fontWeight={'bold'}
                >
                  Акаунт
                </Typography>
                – обліковий запис Учасника, який дозволяє гостю перейти в статус
                зареєстрованого Учасника.
              </Typography>
              <Typography mb={2}>
                <Typography
                  component={'span'}
                  fontWeight={'bold'}
                >
                  Учасник
                </Typography>
                – будь-яка особа, яка звернулась до інформаційних матеріалів та
                сервісів Платформи шляхом відвідування Платформи та має
                відповідний обліковий запис.
              </Typography>
              <Typography mb={2}>
                <Typography
                  component={'span'}
                  fontWeight={'bold'}
                >
                  Менеджер Проєкту
                </Typography>
                – особа, яка має обліковий запис (зареєструвався) на Платформі,
                контролює процес реалізації конкретного проєкту, веде звітність
                щодо реалізації проєкту, з якою Організація укладає договір і
                яка зобовʼязується реалізувати Проєкт відповідно до укладеного
                договору.
              </Typography>
              <Typography mb={2}>
                <Typography
                  component={'span'}
                  fontWeight={'bold'}
                >
                  Контент
                </Typography>
                – інформаційне наповнення сторінок Платформи, у тому числі:
                тексти, графіка, мультимедіа, музичні та літературні твори,
                аудіовізуальні вироби, фонограми, зображення, тексти, посилання,
                їх фрагменти, звітність, будь-яка інша інформація, інші обʼєкти.
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                2. Правила користування Платформою
              </Typography>
              <Typography mb={2}>
                2.1. Основна суть функціонування Платформи – реалізація спільно
                з соціально-активною громадськістю різноспрямованих
                соціально-економічних проєктів завдяки створенню розповсюдженої
                комунікаційної мережі зацікавлених осіб як інструмента для
                ефективного залучення ресурсів на реалізацію цих проєктів, в
                т.ч. благодійних. Проєкти на Платформі розміщуються відповідно
                до прийнятого на Платформі алгоритму подачі проєктів, виключно
                після попередньої модерації проєкту Організацією.
              </Typography>
              <Typography mb={2}>
                2.2. Умови Правил поширюються на всіх користувачів Платформи –
                як на користувачів, що не мають Акаунту (незареєстрований
                користувач), так і на користувачів, що мають будь-який Акаунт,
                будь-якого з доступних видів. Під Акаунтом розуміється
                сукупність інформації про Учасника й даних його авторизації.
                Реєстрація Учасника дозволяє ідентифікувати конкретну особу та є
                обовʼязковою умовою для повноцінного використання сервісів,
                функції та служб Платформи. Після успішної реєстрації для
                Учасника автоматично створюється персональна сторінка та
                надається доступ до Акаунту.
              </Typography>
              <Typography mb={2}>
                2.3. Ставши Учасником Платформи після реєстрації, Учасник дає
                свою згоду на направлення йому повідомлень, додаткової
                інформації про Платформу, її ресурсах та функціях.
              </Typography>
              <Typography mb={2}>
                2.4. Інформація, що міститься на Платформі у вигляді звітів,
                новин, пресрелізів та інших інформаційних матеріалів
                Організації, є актуальною на дату їх складання. У звʼязку з
                наступними подіями й по закінченню часу деяка з цієї інформації
                може виявитися неповною або такою, що не відповідає дійсності,
                однак після її публікації Організація не гарантує оперативної
                зміни такої інформації у звʼязку із подіями, що відбулися.
              </Typography>
              <Typography mb={2}>
                2.5. Усі відносини, що виникають у звʼязку з використанням
                Платформи, регулюються чинним в Україні законодавством, ці
                Правила є письмовою публічною пропозицією Організації для
                невизначеного кола осіб у розумінні ст.ст. 633, 641 та 644
                Цивільного кодексу України.
              </Typography>
              <Typography mb={2}>
                2.6. При виконанні даних Правил, Учасник має право отримувати
                інформацію, розміщену на Платформі, підготувати та розмістити на
                Платформі свій авторський проєкт (після модерації проєкту
                Організацією), поширювати інформацію про проєкти та діяльність
                платформи.
              </Typography>
              <Typography mb={2}>
                2.7. Організація приймає самостійні рішення щодо Платформи, її
                оформлення, розміщення, програмних механізмів тощо. Організація
                не гарантує відповідність Платформи очікуванням Учасника, її
                безперебійну роботу, схоронність Акаунту Учасника та інформації,
                що розміщена на Платформі.
              </Typography>
              <Typography mb={2}>
                2.8. За усі дії, вчинені на Платформі або за її допомогою,
                Учасник несе самостійну відповідальність відповідно до законів
                країни проживання або перебування, має утриматись від
                використання Платформи, якщо існують якісь на то обмеження,
                користується Платформою на власний ризик та під власну
                відповідальність. Реєстрація на Платформі є безкоштовною, плата
                за користування сервісами не стягується.
              </Typography>
              <Typography mb={2}>
                2.9. Організація має право без повідомлення причин обмежити
                Учасника у використанні ресурсу Платформи або окремих функцій,
                якщо таке використання знижує працездатність Платформи або її
                частини, та, з позиції Організації, порушує якимось чином ці
                Правила. Таке обмеження може бути тимчасовим або постійним.
                Акаунт Учасника може бути як заблоковано, так і видалено.
                Організації має право без повідомлення причин призупинити доступ
                до Платформи у випадку технічних несправностей до виправлення
                останніх.
              </Typography>
              <Typography mb={2}>
                2.10. Участь у Платформі дозволена тільки Учаснику, який прийняв
                усі умови даних Правил та Правил Сайту.
              </Typography>
              <Typography mb={2}>
                2.11. Учасник зобовʼязаний ознайомитися з Правилами до взяття
                участі у Платформі. Ознайомившись з Платформою, здійснивши
                Внесок або вчинивши інші дії, направлені на реалізацію прав та
                обовʼязків Учасника Платформи, Учасник надає свою повну згоду з
                умовами даних Правил. Якщо Учасник не погоджується з цими
                Правилами або Правилами Сайту (повністю або частково), йому не
                надається статус Учасника Платформи.
              </Typography>
              <Typography>
                2.12. Якщо законодавство країни проживання або перебування
                Учасника забороняє участь у Платформі з будь-яких причин,
                Учасник повинен утриматися від участі у Платформі.
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                3. Права, обовʼязки та відповідальність сторін
              </Typography>
              <Typography mb={2}>
                3.1. При здійсненні реєстрації Учасник зобовʼязаний вказувати та
                розміщувати достовірні особисті дані, включаючи імена та
                фотографії.
              </Typography>
              <Typography mb={2}>
                3.2. Учасник зобовʼязується:
                <Typography component={'span'} display={'block'} pl={2}>
                  - використовувати Платформу лише в цілях, що не суперечать
                  положенням даних Правил, чинному законодавству України та
                  принципам розумності і моралі;<br/>
                  - розміщувати на Платформі будь-який контент виключно відповідно
                  до умов цих Правил та Угоди про конфіденційність, не розміщувати
                  на Платформі будь-який контент, що може порушувати права та
                  інтереси третіх осіб;<br/>
                  - при реєстрації Акаунту використовувати виключно достовірні
                  особисті дані, нести відповідальність за чистоту даної
                  інформації від претензій третіх осіб;<br/>
                  - інформувати Організацію про спроби несанкціонованого доступу
                  до
                  Акаунту, незаконного використання його логіну або паролю, зміни
                  налаштувань Акаунту без його згоди;
                </Typography>
              </Typography>
              <Typography mb={2}>
                3.3. Учаснику заборонено:
                <Typography component={'span'} display={'block'} pl={2}>
                  - використовувати Платформу для досягнення незаконних або
                  заборонених даними Правилами цілей;<br/>
                  - сприяти розпалюванню або розпалювати релігійні, расові або
                  міжнаціональні ворожнечі;<br/>
                  - розміщувати на Платформі заклики до насильницької зміни
                  конституційного ладу або захоплення державної влади;<br/>
                  заклики до зміни адміністративних меж та/або державного кордону
                  України, порушення порядку, встановленого Конституцією України
                  та законами України, заклики до здійснення погромів, підпалів,
                  знищення майна, захоплення споруд, насильницького виселення
                  громадян, заклики до здійснення агресії і т.д.;<br/>
                  - вчиняти дії, що порушують права і свободи, честь і гідність
                  будь-якої особи;<br/>
                  - використовувати нецензурні висловлювання та мову ворожнечі,
                  навіть якщо вони замасковані під виглядом певних символів
                  (наприклад «*»);<br/>
                  - зловживати своїми правами, при цьому загрожувати будь-кому,
                  залякувати та/або ображати будь-кого;<br/>
                  - створювати та/або поширювати небажану електронну пошту
                  (“спам”)
                  між іншими Учасниками або третіми особами;<br/>
                  - виходити за рамки заздалегідь встановленої теми спілкування
                  (“оффтоп”);<br/>
                  - зловживати розміщенням інформації, що не несе смислового
                  навантаження (“флуд”);<br/> провокувати, починати й/або
                  підтримувати
                  словесну війну, що не має відношення до первинної причини
                  суперечки (Флейм);<br/>
                  - вчиняти дії, спрямовані на введення інших користувачів в
                  оману;<br/>
                  - реєструвати Акаунт від імені або замість іншої особи, без
                  попереднього повідомлення Організації. При цьому, дозволена
                  реєстрація Акаунту від імені й за дорученням іншої фізичної або
                  юридичної особи за умови одержання необхідних повноважень у
                  порядку й формі, передбаченими законодавством України;<br/>
                  - розміщувати інформацію (включаючи будь-які матеріали), що
                  порушує авторські права, права на знаки для товарів і послуг,
                  права промислової власності та/або права на інші обʼєкти
                  інтелектуальної власності, що належать Організації та/або третім
                  особам;<br/>
                  - розміщувати інформацію, що порушує права й законні інтереси
                  третіх осіб (у тому числі, розміщення фотографій і відеозаписів,
                  основним обʼєктом яких є людина, якщо ця людина не давала згоди
                  на розміщення на Платформі фотографії або відеозаписів з її
                  участю);<br/>
                  - розміщувати матеріали рекламного, еротичного, порнографічного
                  або образливого характеру;<br/>
                  використовувати будь-які компʼютерні програми для
                  автоматизованого збору інформації на Платформі;<br/>
                  - здійснювати незаконний збір, систематизацію, зберігання або
                  поширення персональної інформації інших користувачів;<br/>
                  намагатися одержати доступ до Акаунту іншого Учасника будь-яким
                  способом, включаючи, але не обмежуючись, шляхом обману,
                  зловживання довірою, підбору логіна й пароля;<br/>
                  - розміщувати компʼютерні віруси або програми, здатні перервати
                  або порушити нормальну функціональність компʼютерного обладнання
                  та програмного забезпечення, а також засобів телекомунікації
                  будь-яких осіб;<br/> вчиняти дії направлені на безпідставне
                  завантаження на Платформу великих обʼємів інформації та даних,
                  які перешкоджають роботі Платформи та доступу до Платформи інших
                  - Учасників, втручатися в процес роботи Платформи;<br/>
                  вчиняти дії, направлені на обхід вжитих Організацією Платформи
                  заходів по обмеженню доступу Учасника до Платформи.
                </Typography>
              </Typography>
              <Typography mb={2}>
                3.4. Відповідальність Учасника: Учасник самостійно відповідає за
                будь-яке використання інформації, що розміщена на Платформі.
                Учасник самостійно несе відповідальність перед третіми особами
                за свої дії або бездіяльність при використанні Платформи.
                Учасник зобовʼязується самостійно та за свій рахунок врегулювати
                всі можливі претензії третіх осіб, що повʼязані з дією або
                бездіяльністю Учасника при використанні Платформи. якщо
                Учасником не доведено зворотне, будь-які дії, здійснені з
                використанням його Акаунту та/або його логіна й пароля,
                вважаються здійсненими цим Учасником.
              </Typography>
              <Typography mb={2}>
                3.5. Права Організації: у випадках отримання від інших Учасників
                обґрунтованих скарг стосовно некоректної поведінки Учасника на
                Платформі Організація залишає за собою право заблокувати
                сторінку Учасника. Організація залишає за собою право тимчасово
                призупинити або припинити доступ Учасника до Платформи, якщо є
                достатньо підстав вважати, що особисті дані Учасника вказані
                невірно або неповно.
              </Typography>
              <Typography mb={2}>
                У випадку розміщення Учасником на Платформі інформації або
                здійснення інших дій, що не відповідають умовам Правил,
                Організація має право без повідомлення, за власним розсудом,
                видалити повністю або частково розміщену Учасником інформацію,
                включаючи ту інформацію, у відношенні якої важко визначити її
                відповідність Правилам та/або чинному законодавству. за
                порушення умов даних Правил Організація має право без
                попереднього повідомлення заблокувати доступ Учасника до
                Платформи та/або видалити Акаунт Учасника.
              </Typography>
              <Typography mb={2}>
                Організація має право закрити або призупинити функціонування
                Платформи або будь-якої її частини, змінити Платформу повністю
                або частково без попереднього повідомлення Учасника. Організація
                має право призупинити доступ Учасника до Платформи у випадку
                виникнення технічних неполадок на Платформі з метою усунення
                останніх. у випадку, якщо Учасник видаляє свій Акаунт,
                Організація залишає за собою право залишити на Платформі
                контент, що був раніше згенерований та розміщений Учасником.
              </Typography>
              <Typography mb={2}>
                3.6. Відповідальність Організації: Організація не несе
                відповідальності за використання третіми особами інформації,
                включаючи, але не обмежуючись, особисті дані Учасника (якщо вони
                є відкритими у вільному доступі), розміщеної Учасником на
                Платформі, включаючи її копіювання, відтворення й поширення,
                здійснені як у рамках Платформи, так і іншими можливими
                способами.
              </Typography>
              <Typography mb={2}>
                Організація не відшкодовує збитків, прямо або непрямо,
                заподіяних Учаснику або третім особам у результаті використання
                або невикористання, у т.ч. неможливості використання Платформи.
                Організація не приймає на себе зобовʼязань по перевірці, зміні
                та здійсненні контролю інформації, що розміщується будь-ким на
                Платформі, не гарантує й не несе відповідальності за
                достовірність інформації, її законність, якість та відповідність
                конкретним запитам і потребам користувачів Платформи.
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                4. Інтелектуальна власність
              </Typography>
              <Typography mb={2}>
                4.1. Інтелектуальні права на всі компоненти програмного
                забезпечення, на основі яких працюють сервіси та функції
                Платформи, дизайн сторінок, доменне імʼя, відповідні товарні
                знаки та логотипи, контент, розміщений на Платформі, належить
                Організації та не може використовуватись без письмової згоди
                Організації.
              </Typography>
              <Typography mb={2}>
                4.2. Учасник, що розміщує на Платформі будь-яку інформацію, яка
                містить обʼєкти інтелектуальної власності, включаючи, але не
                обмежуючись: текст, графічні зображення, аудіо та
                відеопродукцію, компʼютерні програми, бази даних, знаки для
                товарів і послуг і т.д., гарантує, що завантаження на Платформу,
                копіювання й використання даної інформації та/або обʼєктів
                інтелектуальної власності, що містяться в ній, не буде
                порушувати авторських та інших прав третіх осіб.
              </Typography>
              <Typography mb={2}>
                4.3. Учасник, завантажуючи на Платформу будь-які обʼєкти
                інтелектуальної власності, безоплатно надає Організації
                невиключні майнові права на ці обʼєкти, при умові їх
                використання на некомерційних підставах. Надані Учасником
                Організації майнові права не мають територіального обмеження та
                надаються на весь термін дії авторських прав. Дані майнові права
                включають в себе право на відтворення творів, публічне виконання
                і публічне сповіщення творів, публічну демонстрацію і публічний
                показ, здійснення перекладу, переробки, адаптації, аранжування
                та інші подібні зміни творів, включення творів як складових
                частин до збірників, подання творів до загального відома публіки
                таким чином, що її представники можуть здійснити доступ до
                творів з будь-якого місця і у будь-який час за їх власним
                вибором.
              </Typography>
              <Typography mb={2}>
                4.4. Дані Правила не надають Учасникові ніяких виключних
                майнових прав на будь-які обʼєкти інтелектуальної власності
                Організації або третіх осіб, якщо це явно не вказано, і усі
                права власності стосовно такої власності залишаються винятково
                за Організацією та/або відповідною третьою особою.
              </Typography>
              <Typography mb={2}>
                4.5. Учаснику заборонено будь-яке використання в комерційних
                цілях будь-якої інформації та обʼєктів інтелектуальної
                власності, що розміщені на Платформі, без письмового дозволу на
                це відповідного правоволодільця.
              </Typography>
              <Typography mb={2}>
                4.6. При будь-якому використанні Учасником інформації, що
                розміщені на Платформі, Учасник зобовʼязаний зберігати всі
                авторські посилання та вказувати авторство та гіперпосилання на
                сайт https://citydream.pp.ua у кожному окремому випадку
                використання інформації та творів.
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                5. Обмеження відповідальності
              </Typography>
              <Typography mb={2}>
                5.1. Організація не відповідає перед Учасниками або третіми
                особами за будь-якими зобовʼязаннями Менеджера проєкту щодо
                можливості отримання Донором будь-якої винагороди за здійснення
                Внесків або за вчинення Учасниками будь-яких інших дій.
              </Typography>
              <Typography mb={2}>
                5.2. Організація не відшкодовує будь-які збитки, заподіяні
                Учасникові або третім особам в результаті участі будь-кого у
                Платформі.
              </Typography>
              <Typography mb={2}>
                5.3. Організація не приймає на себе зобовʼязань по перевірці,
                зміні та здійсненні контролю інформації, що супроводжує
                розміщені на Платформі проєкти, не гарантує й не несе
                відповідальності за достовірність такої інформації, її
                законність, якість та відповідність конкретним запитам і
                потребам Учасників Платформи.
              </Typography>
              <Typography mb={2}>
                5.4. Організація не гарантує відповідність Платформи та проєктів
                цілям і очікуванням Учасника.
              </Typography>
              <Typography mb={2}>
                5.5. Учасник самостійно несе відповідальність перед третіми
                особами за свої дії або бездіяльність при участі у Платформі.
              </Typography>
              <Typography mb={2}>
                5.6. Організація не несе відповідальності за шкоду або збитки,
                яких зазнав Учасник або треті особи в результаті помилкового
                розуміння або нерозуміння умов даних Правил, інструкцій або
                вказівок. Якщо Учасник приймає умови Правил Платформи, від
                підтверджує, що усі положення Правил йому повністю зрозумілі.
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                6. Умови конфіденційності
              </Typography>
              <Typography mb={2}>
                6.1. Учасник, у випадку розміщення на Платформі інформації, яка
                відноситься відповідно до Закону України «Про захист
                персональних даних» до персональних даних, погоджується на її
                опрацювання Організацією як за допомогою засобів автоматизації,
                так і без їх використання.
              </Typography>
              <Typography mb={2}>
                6.2. Використовуючи будь-яку частину Платформи, Учасник надає
                Організації право одержувати, зберігати, обробляти,
                використовувати й розкривати персональні дані Учасника на умовах
                даної Угоди. При цьому, Учасник безумовно погоджується: надавати
                вільно свої персональні дані, які маються у загальному доступі
                та вказані на Платформі за ініціативою самого Учасника, як
                Організації, так і іншим Учасникам; дозволити Організації
                відобразити прізвище, імʼя, по батькові, місце проживання,
                адресу електронної пошти Учасника, які маються у загальному
                доступі та вказані на Платформі за ініціативою самого Учасника,
                при відображенні контенту Платформи.
              </Typography>
              <Typography mb={2}>
                6.3. Організація має право завантажувати на компʼютери Учасників
                файли cookie (якщо Учасник самостійно не обмежив дану можливість
                у своєму веб-браузері), а також одержувати, зберігати, обробляти
                й використовувати інформацію, що міститься в Сookies.
              </Typography>
              <Typography mb={2}>
                вона автоматично зберігає, обробляє та використовує дані
                Учасника, що не відносяться до Персональних, наприклад:
                <Typography component={'span'} pl={2} display={'block'}>
                  - IP-адреса Учасника,<br/>
                  - дані про місцезнаходження Учасника, які можна визначити за
                  допомогою його IP-адреси,<br/>
                  - технічні параметри компʼютера Учасника,<br/>
                  - наявність або відсутність у компʼютері Учасника конкретного
                  програмного забезпечення,<br/>
                  - налаштування даного програмного забезпечення,<br/>
                  - файли Сookie, а також статистичну інформація про активність
                  Учасника.
                </Typography>
              </Typography>
              <Typography mb={2}>
                6.5. Організація зобовʼязується не надавати Персональні дані
                третім особам у комерційних цілях без згоди Учасника, якому
                належать ці дані. Передача Персональних даних третім особам
                допускається у наступних випадках: після одержання згоди
                Учасника, якому належить дана інформація; за обґрунтованими
                запитами державних органів, що мають право одержувати такі дані;
                у тому випадку, якщо на думку Організації, Учасник порушує умови
                даної Угоди та/або інших договорів і угод між Організацією та
                Учасником.
              </Typography>
              <Typography mb={2}>
                6.6. Учасник дозволяє Організації надавати дозвіл іншим
                компаніям, з якими Організація уклала відповідні угоди,
                одержувати, зберігати та обробляти дані про Учасника (крім
                Персональних даних), такі як IP-адреса Учасника, файли Сookie, а
                також статистична інформація про активність Учасника для
                покращення якості надаваної цими компаніями послуг та інформації
                рекламного характеру.
              </Typography>
              <Typography mb={2}>
                6.7. Учасник розуміє та погоджується, що інформація, розміщена
                на Платформі, у відношенні якої Учасником не встановлено
                обмежень доступу, може бути вільно доступною будь-якій третій
                особі.
              </Typography>
              <Typography mb={2}>
                6.8. У будь-якому випадку, Учасник при наданні Платформі або
                Організації інформації, яка відносить до персональних даних, дає
                свою беззаперечну та безвідкличну згоду на оброблення та
                зберігання таких персональних даних, а також, за необхідності,
                їх передачу третім особам в порядку і на умовах, передбачених
                законодавством України.
              </Typography>
              <Typography mb={2}>
                6.9. У випадку, коли при використанні Платформи Учаснику
                будь-яким способом стала відома інформація відносно Організації
                та/або третіх осіб, яка відповідно до законодавства України
                відноситься до конфіденційної та/або до комерційної таємниці,
                Учаснику заборонено зберігати, використовувати й поширювати таку
                інформацію.
              </Typography>
              <Typography mb={2}>
                6.10. Організація не несе відповідальності за шкоду або збитки,
                яких зазнав Учасник або треті особи в результаті помилкового
                розуміння або нерозуміння умов даної Угоди, інструкцій або
                вказівок про порядок використання Платформи, щодо порядку
                розміщення даних та інших технічних питань. До моменту прийняття
                умов даної Угоди будь-який Учасник має право звернутися до
                Організації для отримання розʼяснень щодо положень Угоди.
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                7. Інші умови (загальні)
              </Typography>
              <Typography mb={2}>
                7.1. Організація має право в односторонньому порядку вносити
                зміни в дані Правила. Усі внесені до Правил зміни будуть
                доступні у вигляді нової редакції Правил.
              </Typography>
              <Typography mb={2}>
                7.2. Організація не несе відповідальності за шкоду або збитки,
                яких зазнав Учасник або треті особи в результаті помилкового
                розуміння або нерозуміння умов даних Правил, інструкцій або
                вказівок про порядок використання Платформи, щодо порядку
                розміщення даних та інших технічних питань.
              </Typography>
              <Typography mb={2}>
                7.3. Організація може в будь-який момент і без повідомлення
                Учасника поступитися своїми правами за даними Правилами на
                користь третьої сторони. Учасник надає право Організації
                надсилати йому повідомлення, які містять інформацію про
                Платформу, проєкти Платформи, або інформацію рекламного
                характеру, яка повʼязана із функціонуванням Платформи.
              </Typography>
              <Typography mb={2}>
                7.4. До даних Правил й відносин між Організацією та Учасником,
                що виникають у звʼязку з використанням Платформи, застосовується
                законодавство України. Кожна сторона незаперечно погоджується з
                тим, що відповідні суди України мають виняткову юрисдикцію
                відносно будь-яких претензій, спорів або розбіжностей, що
                стосуються Правил та використання Платформи.
              </Typography>
            </Box>
          </Box>
        </Container>
      </Box>
    </>
  );
};

export default TermsAndUse;
