import Head from 'next/head';
import { Box } from '@mui/system';
import { Container, Typography } from '@mui/material';

const PrivacyPolicy = () => {

  return (
    <>
      <Head>
        <title>City dream | GDPR/Правила приватності</title>
        <meta name="description" content="GDPR/Privacy and policy"/>
        <link rel="icon" href="/favicon.ico"/>
      </Head>
      <Box component={'main'}>
        <Container>
          <Box mt={'64px'} mb={'110px'}>
            <Box textAlign={'center'} mb={6}>
              <Typography variant={'h1'} component={'h1'} mb={2}>
                GDPR/Правила приватності
              </Typography>
              <Typography variant={'h3'} component={'h2'} mb={2}>
                ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ (v.0.1)
              </Typography>
              <Typography variant={'h3'} component={'h2'}>
                Краудсорсингової Платформи citydream.pp.ua
                (далі «Політика»)
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                1. ЗАГАЛЬНІ ПОЛОЖЕННЯ
              </Typography>
              <Typography mb={2}>
                Конфіденційність користувачів є для нас важливою, тому ми
                докладаємо багато зусиль, щоб захистити її та зробити процедуру
                прозорою для вас.
              </Typography>
              <Typography mb={2}>
                Основною метою Політики є пояснення вам (користувачу Сайту)
                командою City Dream (далі – «ми») порядок обробки (а саме: збір,
                накопичення, систематизування, зберігання, уточнення,
                використання, поширення, знеособлення, блокування, знищення)
                ваших
                даних (далі – «Персональна інформація» та/або «Персональні
                дані»).
              </Typography>
              <Typography mb={2}>
                Якщо ви не погоджуєтесь з умовами та положеннями Політики, ви
                повинні припинити використання сайту
                https://www.citydream.pp.ua/
                (далі – «Сайт»). Ми можемо в односторонньому порядку змінювати
                положення Політики. Тому ви повинні періодично перевіряти
                Політику
                та ознайомлюватись з оновленнями.
              </Typography>
              <Typography mb={2}>
                Продовжуючи користуватись Сайтом після внесення змін, ви
                погоджуєтесь з новою редакцією Політики.
              </Typography>
              <Typography>
                Якщо у вас виникнуть питання стосовно умов та положень Політики
                ви
                можете звернутись за наданням відповідей за електронною адресою:
                support@citydream.pp.ua. За цією ж адресою ви можете відізвати
                свою згоду на використання ваших Персональних даних, направивши
                відповідне повідомлення (звернення).
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                2. ЗБІР ІНФОРМАЦІЇ
              </Typography>
              <Typography mb={2}>
                Збору, зберіганню та використанню підлягає інформація:
                <Typography component={'span'} display={'block'} pl={2}>
                  - про пристрій (ноутбук, смартфон тощо) яким ви користуєтесь
                  для
                  доступу до Сайту, включаючи IP-адресу та географічне
                  розташування;<br/>
                  - щодо типу підключення до мережі (WiFi, 4G, LTE тощо) та
                  браузеру (Google Chrome, Opera тощо), що ви
                  використовуєте;<br/>
                  - виду операційної системи пристрою входу (iOS, Android, MacOS
                  або Windows);<br/>
                  - стосовно «географії» та «навігації» відвідування та
                  використання Сайту (сторінки, гіперпосилання, метадані
                  тощо);<br/>
                  - файли cookie (це дані, які веб-сайт може відправити вашому
                  браузеру, і вони будуть збережені на вашому пристрої для
                  подальшої ідентифікації його веб-сайтом);<br/>
                  - що ідентифікує вас та яку ви надаєте при реєстрації та/або
                  за
                  допомогою електронного листування та/або при здійсненні
                  фінансової підтримки соціальних проєктів розміщених на Сайті
                  (зокрема, але не виключно: прізвище, імʼя, по батькові,
                  контактна адреса електронної пошти, акаунти в соціальних
                  мережах, освіта, місце роботи, номер телефону, реквізити
                  кредитної карти, дані надісланих вами повідомлень, ваші
                  фотографії (якщо ви розмістили їх при реєстрації облікового
                  запису на Сайті та/або надали їх нам іншим чином) тощо);<br/>
                  - будь-яка інша персональна інформація, яку ви надіслали нам.
                </Typography>
              </Typography>
              <Typography mb={2}>
                Персональна інформація, яку ми обробляємо, ми отримуємо, зокрема
                але не виключно, з наступних джерел:
                <Typography component={'span'} display={'block'} pl={2}>
                  - форма реєстрації та оплати на Сайті;<br/>
                  - авторизація та аутентифікація користувача, включаючи
                  соціальні
                  мережі та акаунти Google;<br/>
                  - електронне листування з нами.
                </Typography>
              </Typography>
              <Typography mb={2}>
                Якщо ви надаєте нам Персональні дані третіх осіб, то ви
                гарантуєте, що отримали згоду цієї особи на таке розкриття та
                обробку згідно Політики та вимог чинного законодавства України.
              </Typography>
              <Typography mb={2}>
                Ви несете повну відповідальність за забезпечення достовірності
                наданих вами Персональних даних. У разі предʼявлення нам
                претензій, повʼязаних з такою інформацією, ви зобовʼязані
                самостійно врегулювати претензії таких осіб
              </Typography>
              <Typography>
                Ви зобовʼязані оновлювати Персональні дані у випадку їх зміни,
                зокрема, своєчасно інформувати нас про зміну власної електронної
                адреси.
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                3. ВИКОРИСТАННЯ ІНФОРМАЦІЇ
              </Typography>
              <Typography mb={2}>
                Персональні дані, які ви нам надали будуть використовуватись для
                цілей, зазначених в Політиці або на відповідних сторінках Сайту.
                Ми можемо використовувати вашу Персональну інформацію для:<br/>
                <Typography component={'span'} display={'block'} pl={2}>
                  - роботи нашого Сайту та надання вам можливості користуватися
                  Сайтом;<br/>
                  - обробки платежів, які ви добровільно здійснюєте для
                  підтримки
                  соціальних проєктів, що розміщені на Сайті;<br/>
                  - обміну з вами повідомленнями шляхом електронного листування
                  для надання відповідей на ваші питання;<br/>
                  - надсилання вами немаркетингових повідомлень;<br/>
                  - інформаційно-маркетингової розсилки (ви можете повідомити
                  нас
                  про відмову від отримання такої розсилки) або самостійно
                  відписатися від розсилки шляхом переходу за відповідним
                  посиланням-відмовою від розсилки (знаходиться у футері кожного
                  нашого повідомлення), яке є частиною кожного нашого
                  повідомлення
                  на вашу електронну пошту;<br/>
                  - обробки запитів та скарг, зроблених вами або на вас, і які
                  стосуються Сайту;<br/>
                  - забезпечення безпеки Сайту та попередження шахрайства;<br/>
                  - розміщення на Сайті та/або публікацій про вас у разі, якщо
                  ви
                  маєте намір або здійснили розміщення вашого соціального
                  проєкту
                  на Сайті;<br/>
                  - надання технічної підтримки;<br/>
                  - підтвердження вашої особи та для підтвердження достовірності
                  наданих даних;<br/>
                  - інших цілей.
                </Typography>
              </Typography>
              <Typography mb={2}>
                Крім того, ми можемо передавати ваші Персональні дані та ваші
                результати ваших соціальних проєктів у інші засоби масової
                інформації (сайти, масмедіа тощо) задля поширення інформації про
                нашу та вашу діяльність.
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                4. РОЗКРИТТЯ ІНФОРМАЦІЇ
              </Typography>
              <Typography mb={2}>
                Ми маємо право передавати ваші Персональні дані третім особам,
                якщо:
                <Typography component={'span'} display={'block'} pl={2}>
                  - ви самостійно виявили бажання розкрити надану
                  інформацію;<br/>
                  - без цього ви не зможете використовувати всі функціональні
                  можливості Сайту;<br/>
                  - цього вимагають органи державної влади з дотриманням
                  законної
                  процедури;<br/>
                  - необхідно захистити наші законні права та інтереси
                  (включаючи
                  надання інформації іншим сторонам задля запобігання шахрайству
                  тощо);<br/>
                  - відбудеться реорганізація (злиття, приєднання, поділ,
                  перетворення), тому дані будуть передані
                  правонаступникам;<br/>
                  - ви порушуєте умови Політики.
                </Typography>
              </Typography>
              <Typography mb={2}>
                Ми залишаємо за собою право передавати ваші Персональні дані
                нашим працівникам та/або представникам, партнерам,
                постачальникам або субпідрядникам, в обʼємі та цілях, визначених
                Політикою.
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                5. ЗБЕРЕЖЕННЯ ІНФОРМАЦІЇ
              </Typography>
              <Typography mb={2}>
                Персональні дані, які ми обробляємо з метою та для цілей, що
                зазначені у Політиці не повинні зберігатися довше, ніж потрібно
                для досягнення цієї мети або цих цілей. Персональна інформація
                може бути видалена відразу (у розумні строки) після направлення
                вами відповідного запиту (повідомлення).
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                6. ЗАХИСТ ІНФОРМАЦІЇ
              </Typography>
              <Typography mb={2}>
                Ми будемо вживати достатні технічні та організаційні заходи для
                попередження втрати, протиправного використання чи підробки
                ваших Персональних даних, та не будемо передавати їх третім
                особам, за винятком випадків, передбачених Політикою та чинним
                законодавством. Персональна інформація, що була/буде надана
                вами, зберігається на захищених (як паролем, так і фаєрволами)
                серверах, а електронні фінансові транзакції будуть захищені
                технологією шифрування даних.
              </Typography>
              <Typography mb={2}>
                Ви підтверджуєте, що розумієте те, що Персональна інформація при
                передачі через мережу Інтернет не може бути захищеною на 100%, і
                ми не можемо гарантувати повний захист Персональних даних
                переданих таким способом. Ви несете відповідальність за захист
                ваших Персональних даних, в тому числі засобів авторизації для
                доступу до Сайту.
              </Typography>
              <Typography mb={2}>
                Наш Сайт може містити гіперпосилання на веб-сайти сторонніх
                компаній та осіб. Ми не можемо нести відповідальність за зміст
                (контент) таких ресурсів (сайтів) та їх відповідність чинному
                законодавству, за працездатність (можливі помилки або збоїв в
                роботі) таких ресурсів (сайтів), за будь-які прямі або непрямі
                наслідки будь-якого використання або неможливості використання
                таких ресурсів (сайтів), а також за способи захисту інформації.
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                7. ВАШІ ПРАВА
              </Typography>
              <Typography mb={2}>
                Ви можете направити нам повідомлення стосовно того, щоб ми
                надали вам будь-яку Персональну інформацію про вас, яку ми
                маємо, та отримати її копію. Але ми можемо відмовити вам на
                запит в звʼязку з положеннями чинного законодавства.
              </Typography>
              <Typography mb={2}>
                Ви можете самостійно видалити ваш обліковий запис створений вами
                на Сайті. Ви можете надати нам вказівку не обробляти ваші
                персональні дані для інформаційно-маркетингових цілей, для цього
                достатньо проставити відмітку у відповідній формі, або написати
                нам за електронною адресою: support@citydream.pp.ua.
              </Typography>
              <Typography mb={2}>
                Отримати додаткову інформацію щодо ваших прав ви можете
                направивши відповідний запит (повідомлення) на електронну
                адресу: support@citydream.pp.ua.
              </Typography>
            </Box>

            <Box mb={5}>
              <Typography variant={'h4'} component={'h3'} mb={3}>
                8. КОНТАКТНА ІНФОРМАЦІЯ
              </Typography>
              <Typography mb={2}>
                Якщо у вас є/будуть запитання та/або скарги, ви можете
                звʼязатися з нами, написавши повiдомлення на електронну адресу:
                support@citydream.pp.ua.
              </Typography>
            </Box>
          </Box>
        </Container>
      </Box>
    </>
  );
};

export default PrivacyPolicy;
